[
  {
    "ingredients": [
      "4 red bell peppers",
      "2 medium to large onions",
      "3 bulbs of garlic",
      "2 teaspoons salt",
      "1/2 a Scotch bonnet pepper",
      "1/4 pound plum tomatoes",
      "1/4 cup sunflower oil",
      "1 teaspoon dried thyme",
      "1/2 teaspoon ground ginger",
      "1/2 teaspoon cayenne pepper or alternative",
      "1/4 teaspoon smoked paprika",
      "1 heaping teaspoon tomato paste",
      "Generous 2 cups chicken stock",
      "1 teaspoon red palm oil",
      "1 1/4 cups white basmati rice"
    ],
    "picture_link": "https://cdn.greatlifepublishing.net/wp-content/uploads/sites/2/2022/07/31010514/Nigerian-Jollof-Rice-Horizontal-3.jpg",
    "instructions": "Finely slice the peppers and onions. Make a paste out of the garlic and 1 teaspoon of salt. Seed and slice the Scotch bonnet pepper, dice the tomatoes and set them aside. Soften the onions and peppers in the sunflower oil over high heat for 5 minutes, stirring frequently. Add the pasted garlic, Scotch bonnet pepper, tomatoes, and dry seasonings and cook for another 10 minutes over medium heat, stirring frequently. Add the tomato paste, cook for another minute or so, then remove from the heat. Blend the mixture with a generous 3/4 cup of chicken stock. If this was prepared in advance, reheat it first. Add another 3/4 cup of stock and blend until the mixture is smooth. Add the palm oil, a final teaspoon of salt, and then pour 2 1/2 cups of this mixture back into the pot. Heat the sauce until it is lightly bubbling. Measure out your rice, then add to the pot. The pot should have a tight-fitting lid, but if it doesn’t you can use some foil with the shiny side facing down to retain the heat. Stir gently so that all the rice is coated with the red sauce, then reduce the heat to a very low flame—the lowest possible. Cover and simmer for 10 minutes. Open the lid and stir gently again. It is important to get under the center of the pan so all the rice cooks at the same rate. Cover and simmer for another 10 minutes. Open and stir for a final time, then simmer for a final 10 minutes. This makes 30 minutes cooking time in total. Turn the heat off and allow to steam, covered, for another 15 minutes. It’s tempting to open the pot here but it’s very important to trust the process and allow the rice to cook residually. This improves the final taste and texture of the rice. Open the lid then leave to stand for 5 minutes, uncovered. Then fluff with a fork to separate the rice, slowly working inward from the edge of the pan in a swirling motion. If the rice is not completely cooked, add the remaining 1/2 cup stock, stir gently, then place back over low heat for another 10 minutes. Spoon the rice out onto a separate dish and serve.\nFinely slice the peppers and onions. Make a paste out of the garlic and 1 teaspoon of salt. Seed and slice the Scotch bonnet pepper, dice the tomatoes and set them aside. Soften the onions and peppers in the sunflower oil over high heat for 5 minutes, stirring frequently. Add the pasted garlic, Scotch bonnet pepper, tomatoes, and dry seasonings and cook for another 10 minutes over medium heat, stirring frequently. Add the tomato paste, cook for another minute or so, then remove from the heat.\nBlend the mixture with a generous 3/4 cup of chicken stock. If this was prepared in advance, reheat it first. Add another 3/4 cup of stock and blend until the mixture is smooth. Add the palm oil, a final teaspoon of salt, and then pour 2 1/2 cups of this mixture back into the pot. Heat the sauce until it is lightly bubbling. Measure out your rice, then add to the pot. The pot should have a tight-fitting lid, but if it doesn’t you can use some foil with the shiny side facing down to retain the heat. Stir gently so that all the rice is coated with the red sauce, then reduce the heat to a very low flame—the lowest possible.\nCover and simmer for 10 minutes. Open the lid and stir gently again. It is important to get under the center of the pan so all the rice cooks at the same rate. Cover and simmer for another 10 minutes. Open and stir for a final time, then simmer for a final 10 minutes. This makes 30 minutes cooking time in total. Turn the heat off and allow to steam, covered, for another 15 minutes. It’s tempting to open the pot here but it’s very important to trust the process and allow the rice to cook residually. This improves the final taste and texture of the rice.\nOpen the lid then leave to stand for 5 minutes, uncovered. Then fluff with a fork to separate the rice, slowly working inward from the edge of the pan in a swirling motion. If the rice is not completely cooked, add the remaining 1/2 cup stock, stir gently, then place back over low heat for another 10 minutes. Spoon the rice out onto a separate dish and serve.",
    "title": "Jollof Rice"
  },
  {
    "ingredients": [
      "1 (13- to 14-ounce) can well-stirred unsweetened coconut milk",
      "3 tablespoons sugar",
      "1 1/2 teaspoons fresh lime juice, or to taste",
      "1 large honeydew melon (5 pounds), chilled",
      "Garnish: julienned lime zest",
      "Special equipment: a melon-ball cutter"
    ],
    "picture_link": "https://i0.wp.com/theweatheredgreytable.com/wp-content/uploads/2014/10/desserts-fruit-fresh-honeydew-melon-in-coconut-milk-1.jpg?fit=1200%2C900&ssl=1",
    "instructions": "Stir together coconut milk, sugar, and lime juice in a small metal bowl until sugar is dissolved, then quick-chill in a metal bowl set in a larger bowl of ice and cold water, stirring occasionally, about 6 minutes. Halve melon and discard seeds. Scoop melon into balls with cutter. Divide melon among 8 serving dishes, then pour coconut milk over top. Serve immediately.\nStir together coconut milk, sugar, and lime juice in a small metal bowl until sugar is dissolved, then quick-chill in a metal bowl set in a larger bowl of ice and cold water, stirring occasionally, about 6 minutes.\nHalve melon and discard seeds. Scoop melon into balls with cutter.\nDivide melon among 8 serving dishes, then pour coconut milk over top. Serve immediately.",
    "title": "Honeydew Melon in Coconut Milk"
  },
  {
    "ingredients": [
      "6 tablespoons vegetable oil, divided",
      "1/4 cup fresh lime juice",
      "4 scallions, coarsely chopped",
      "4 Scotch bonnet or habanero chiles, stemmed, seeded, coarsely chopped",
      "3 garlic cloves, roughly chopped",
      "2 tablespoons fresh thyme",
      "1 tablespoon minced peeled fresh ginger",
      "1 tablespoon (packed) dark brown sugar",
      "2 teaspoons allspice berries",
      "1 teaspoon kosher salt plus more",
      "1/4 teaspoon freshly ground black pepper",
      "2 tablespoons distilled white vinegar",
      "Ingredient Info: Habaneros and Scotch bonnets—extremely hot chiles—are available at better supermarkets and at Latin markets"
    ],
    "picture_link": "https://i2.wp.com/chilipeppermadness.com/wp-content/uploads/2019/04/Jerk-Chicken-Marinating.jpg",
    "instructions": "Purée 4 tablespoons oil and the next 10 ingredients in a food processor until smooth. Transfer 1/4 cup marinade to a small bowl and make sauce: Whisk in vinegar and remaining 2 tablespoons oil and season to taste with salt. Refrigerate sauce. Put meat in a glass, stainless-steel, or ceramic dish. Toss with remaining marinade. Cover and chill for at least 3 hours or overnight. Remove meat from marinade, pat dry, and grill.\nPurée 4 tablespoons oil and the next 10 ingredients in a food processor until smooth. Transfer 1/4 cup marinade to a small bowl and make sauce: Whisk in vinegar and remaining 2 tablespoons oil and season to taste with salt. Refrigerate sauce. Put meat in a glass, stainless-steel, or ceramic dish. Toss with remaining marinade. Cover and chill for at least 3 hours or overnight.\nRemove meat from marinade, pat dry, and grill.\nThe finish: Spoon reserved sauce over grilled meat.\nSpoon reserved sauce over grilled meat.",
    "title": "Jerk Marinade"
  },
  {
    "ingredients": [
      "1/2 pound (1/8- to 1/4-inch wide) dried rice stick noodles",
      "2 1/2 tablespoons soy sauce",
      "1 tablespoon water",
      "1 1/2 tablespoons vegetable oil, divided",
      "2 large eggs, lightly beaten with a pinch of salt",
      "1/2 pound peeled and deveined large shrimp",
      "1 tablespoon chile paste (sambal oelek) or Chinese garlic chile paste",
      "3 ounces Spanish chorizo, halved lengthwise, casing removed if desired (see Cooks' Notes), sausage thinly sliced crosswise",
      "2 large garlic cloves, finely chopped",
      "1/2 pound jicama, peeled and cut into 1/4-inch-thick matchsticks",
      "1 bunch scallions (greens only), cut crosswise into 1 1/2-inch lengths",
      "Lime wedges for serving",
      "Special equipment: A 14-inch wok, preferably flat-bottomed, or a 12-inch heavy skillet"
    ],
    "picture_link": "https://www.elmundoeats.com/wp-content/uploads/2018/07/Penang-Char-Kway-Teow-1.jpg",
    "instructions": "Soak noodles in cold water to cover 30 minutes, then drain. Cook noodles in a large (5- to 6-quart) pot of boiling salted water 4 minutes. Drain noodles in a colander, then rinse thoroughly and drain well. Stir together soy sauce and water, then reserve. Heat 1 1/2 teaspoons oil in wok or skillet over medium-high heat until shimmering, then add eggs and stir-fry until just cooked through, about 30 seconds. Transfer to a plate and wipe out pan, if necessary. Heat remaining 1 tablespoon oil in pan until shimmering and stir-fry shrimp and chile paste 30 seconds (shrimp will not be cooked through). Add chorizo and garlic and stir-fry until shrimp are just cooked through, 30 seconds to 1 minute. Add soy mixture, cooked noodles, jicama, and scallions, and stir-fry until noodles are heated through and scallion greens are wilted, about 1 minute. Remove pan from heat and stir in eggs. Serve immediately.\nSoak noodles in cold water to cover 30 minutes, then drain. Cook noodles in a large (5- to 6-quart) pot of boiling salted water 4 minutes. Drain noodles in a colander, then rinse thoroughly and drain well.\nStir together soy sauce and water, then reserve.\nHeat 1 1/2 teaspoons oil in wok or skillet over medium-high heat until shimmering, then add eggs and stir-fry until just cooked through, about 30 seconds. Transfer to a plate and wipe out pan, if necessary.\nHeat remaining 1 tablespoon oil in pan until shimmering and stir-fry shrimp and chile paste 30 seconds (shrimp will not be cooked through).\nAdd chorizo and garlic and stir-fry until shrimp are just cooked through, 30 seconds to 1 minute.\nAdd soy mixture, cooked noodles, jicama, and scallions, and stir-fry until noodles are heated through and scallion greens are wilted, about 1 minute.\nRemove pan from heat and stir in eggs. Serve immediately.",
    "title": "Penang Fried Rice Noodles"
  },
  {
    "ingredients": [
      "6 sweet potatoes",
      "Salted butter",
      "Chinese five-spice powder",
      "Orange peel, grated"
    ],
    "picture_link": "https://joyfuldumplings.com/wp-content/uploads/2022/07/sauteed-sweet-potato-1.jpg",
    "instructions": "Roast sweet potatoes at 425°F until soft, about 50 minutes. Split in half lengthwise, then dot with butter. Sprinkle the Chinese five-spice powder and freshly grated orange peel. (Look for Chinese five-spice powder in the spice section of the supermarket.)\nRoast sweet potatoes at 425°F until soft, about 50 minutes. Split in half lengthwise, then dot with butter. Sprinkle the Chinese five-spice powder and freshly grated orange peel. (Look for Chinese five-spice powder in the spice section of the supermarket.)",
    "title": "Roasted Sweet Potatoes with Five-Spice Butter"
  },
  {
    "ingredients": [
      "3 1/2 cups whole milk",
      "8 large egg yolks",
      "2/3 cup sugar",
      "3 tablespoons cornstarch",
      "1/4 teaspoon salt",
      "1 tablespoon unsalted butter",
      "1 teaspoon pure vanilla extract",
      "Equipment: an instant-read thermometer"
    ],
    "picture_link": "https://www.savoryexperiments.com/wp-content/uploads/2022/11/Vanilla-Custard-6.jpg",
    "instructions": "Heat milk in a heavy medium saucepan over medium heat until hot but not boiling. Meanwhile, whisk together yolks, sugar, cornstarch, and salt in a medium bowl. Add hot milk to egg mixture in a slow stream, whisking constantly, then pour custard back into saucepan. Cook over medium-low heat, stirring constantly, until thickened and registers 170°F (do not let boil). Immediately strain through a fine-mesh sieve into a clean bowl and stir in butter and vanilla. Chill custard, its surface covered with parchment paper (to prevent a skin from forming), until cold, 2 to 3 hours.\nHeat milk in a heavy medium saucepan over medium heat until hot but not boiling.\nMeanwhile, whisk together yolks, sugar, cornstarch, and salt in a medium bowl.\nAdd hot milk to egg mixture in a slow stream, whisking constantly, then pour custard back into saucepan. Cook over medium-low heat, stirring constantly, until thickened and registers 170°F (do not let boil). Immediately strain through a fine-mesh sieve into a clean bowl and stir in butter and vanilla. Chill custard, its surface covered with parchment paper (to prevent a skin from forming), until cold, 2 to 3 hours.",
    "title": "Vanilla Custard"
  },
  {
    "ingredients": [
      "2 28–ounce cans Italian tomatoes (such as San Marzano) with juice",
      "1 English hothouse cucumber, peeled, chopped (about 2 cups)",
      "1/2 cup fresh lemon juice",
      "2 tablespoons fresh cilantro leaves",
      "4 teaspoons prepared horseradish",
      "4 teaspoons Worcestershire sauce",
      "2 teaspoons celery salt",
      "12 dashes of hot pepper sauce",
      "Ice cubes",
      "2 cups vodka",
      "1 English hothouse cucumber, halved crosswise, then quartered lengthwise"
    ],
    "picture_link": "https://vinepair.com/wp-content/uploads/2017/06/gaz-internal2.jpg",
    "instructions": "Working in batches, puree first 8 ingredients in blender until smooth. Transfer Bloody Mary mix to large pitcher; season with pepper. Chill until cold, at least 1 hour. For each drink, fill 8-ounce highball glass with ice cubes; pour 1/4 cup vodka over. Add Bloody Mary mix; garnish with cucumber spear.\nWorking in batches, puree first 8 ingredients in blender until smooth. Transfer Bloody Mary mix to large pitcher; season with pepper. Chill until cold, at least 1 hour.\nFor each drink, fill 8-ounce highball glass with ice cubes; pour 1/4 cup vodka over. Add Bloody Mary mix; garnish with cucumber spear.",
    "title": "Gazpacho Bloody Marys"
  },
  {
    "ingredients": [
      "3 cups all-purpose flour",
      "1/2 teaspoon baking soda",
      "About 2 1/2 teaspoons sea salt, divided",
      "10 ounces unsalted butter, at room temperature",
      "1 cup vanilla sugar",
      "2 large eggs",
      "1 teaspoon vanilla extract",
      "12 ounces bitter chocolate chips, or bitter chocolate cut in very small pieces"
    ],
    "picture_link": "https://cdn.statically.io/img/whitneybond.com/f=auto/wp-content/uploads/2020/12/chocolate-chunk-cookies-9.jpg",
    "instructions": "Preheat the oven to 375°. Line two baking sheets with parchment paper. Sift together onto a piece of waxed paper the flour, the soda, and one half teaspoon of the salt. In a large bowl, whisk together the butter and the sugar until it is light and pale yellow. Whisk in the eggs one at a time until thoroughly blended. Whisk in the vanilla, then stir in the flour just until it is blended. Stir in the chocolate chips or pieces and mix until they are evenly distributed throughout the dough. Drop the dough by tablespoons full onto the prepared baking sheets. Sprinkle each with a generous pinch of sea salt. Bake in the center of the oven until the cookies are golden, about 12 minutes. Remove from the oven and let sit on the baking sheets for about 4 minutes to allow the cookies, which are fragile, to firm up, then slide them onto a cooling rack.\nPreheat the oven to 375°. Line two baking sheets with parchment paper.\nSift together onto a piece of waxed paper the flour, the soda, and one half teaspoon of the salt.\nIn a large bowl, whisk together the butter and the sugar until it is light and pale yellow. Whisk in the eggs one at a time until thoroughly blended. Whisk in the vanilla, then stir in the flour just until it is blended.\nStir in the chocolate chips or pieces and mix until they are evenly distributed throughout the dough.\nDrop the dough by tablespoons full onto the prepared baking sheets. Sprinkle each with a generous pinch of sea salt. Bake in the center of the oven until the cookies are golden, about 12 minutes. Remove from the oven and let sit on the baking sheets for about 4 minutes to allow the cookies, which are fragile, to firm up, then slide them onto a cooling rack.",
    "title": "Chocolate Chip Cookies with Salt"
  },
  {
    "ingredients": [
      "12 ounces dark chocolate chips or chopped dark chocolate (preferably 63% cacao)",
      "1 cup mini marshmallows",
      "3/4 cup crushed peppermint candies or candy canes (about 4 1/2 ounces), divided"
    ],
    "picture_link": "https://www.sixsistersstuff.com/wp-content/uploads/2013/11/4-Ingredient-Rocky-Road-Fudge-from-SixSistersStuff.jpg",
    "instructions": "Line 2 rimmed baking sheets with parchment or wax paper. Heat chocolate in a medium heatproof bowl set over a medium pot of barely simmering water (bottom of bowl should not touch water), stirring occasionally, or in short bursts in the microwave, stirring in between bursts, until chocolate is melted and smooth. Fold marshmallows and 1/2 cup candies into chocolate until evenly combined. Drop heaping tablespoonfuls of chocolate mixture onto prepared baking sheets; sprinkle with remaining 1/4 cup candies. Chill until set, about 30 minutes. Serve at room temperature.\nLine 2 rimmed baking sheets with parchment or wax paper. Heat chocolate in a medium heatproof bowl set over a medium pot of barely simmering water (bottom of bowl should not touch water), stirring occasionally, or in short bursts in the microwave, stirring in between bursts, until chocolate is melted and smooth.\nFold marshmallows and 1/2 cup candies into chocolate until evenly combined. Drop heaping tablespoonfuls of chocolate mixture onto prepared baking sheets; sprinkle with remaining 1/4 cup candies. Chill until set, about 30 minutes. Serve at room temperature.\nDo Ahead Candies can be made 5 days ahead; transfer to an airtight container and chill.\nCandies can be made 5 days ahead; transfer to an airtight container and chill.",
    "title": "3-Ingredient Peppermint Rocky Road Candies"
  },
  {
    "ingredients": [
      "1/4 cup cider vinegar",
      "1/4 cup molasses",
      "1/4 cup olive oil",
      "1 teaspoon ground allspice",
      "1 teaspoon salt",
      "1 teaspoon freshly ground black pepper",
      "6 semi-boneless quail*",
      "3 tablespoons cider vinegar",
      "2 teaspoons honey",
      "4 bacon slices, chopped coarse",
      "1 teaspoon caraway seeds, crushed lightly",
      "3 cups very thinly sliced red cabbage",
      "2 medium carrots, shredded fine",
      "3 cups very thinly sliced Napa cabbage",
      "4 scallions, sliced thin",
      "*available at some butcher shops"
    ],
    "picture_link": "https://gustotv.com/wp-content/uploads/2020/04/Grilled-Quail-with-Wilted-Cabbage-Slaw-pic00.jpg",
    "instructions": "Make marinade: In a small bowl whisk together marinade ingredients.\nIn a small bowl whisk together marinade ingredients.\nRinse quail and pat dry. Arrange quail in a flat-bottomed dish large enough to hold them in one layer and add marinade, turning quail to coat well. Marinate quail, covered and chilled, turning them once or twice, at least 1 day and up to 2. Prepare grill and bring quail to room temperature (about 30 minutes). Remove quail from marinade, discarding marinade, and pat dry with paper towels. Season quail with salt and pepper and grill on an oiled rack set about 5 to 6 inches over glowing coals 3 to 4 minutes on each side, or until just cooked through. Meat should still be pink. (Alternatively, grill quail in batches without crowding in a hot oiled well-seasoned ridged grill pan.) Transfer quail as cooked to a plate and keep warm, covered.\nRinse quail and pat dry. Arrange quail in a flat-bottomed dish large enough to hold them in one layer and add marinade, turning quail to coat well. Marinate quail, covered and chilled, turning them once or twice, at least 1 day and up to 2.\nPrepare grill and bring quail to room temperature (about 30 minutes).\nRemove quail from marinade, discarding marinade, and pat dry with paper towels. Season quail with salt and pepper and grill on an oiled rack set about 5 to 6 inches over glowing coals 3 to 4 minutes on each side, or until just cooked through. Meat should still be pink. (Alternatively, grill quail in batches without crowding in a hot oiled well-seasoned ridged grill pan.) Transfer quail as cooked to a plate and keep warm, covered.\nMake slaw: In a cup or very small bowl stir together vinegar and honey. In a 12-inch heavy skillet cook bacon over moderate heat, stirring, until crisp. Transfer bacon with a slotted spoon to a small bowl and pour off all but about 2 tablespoons bacon fat from skillet. Heat bacon fat remaining in skillet over moderately high heat until hot but not smoking and cook caraway seeds, stirring, until fragrant, about 30 seconds. Add red cabbage, carrots, vinegar mixture, and salt and pepper to taste and sauté, stirring, until cabbage is just wilted, about 1 minute. Remove skillet from heat and add Napa cabbage and scallions, tossing until cabbage is wilted slightly.\nIn a cup or very small bowl stir together vinegar and honey. In a 12-inch heavy skillet cook bacon over moderate heat, stirring, until crisp. Transfer bacon with a slotted spoon to a small bowl and pour off all but about 2 tablespoons bacon fat from skillet.\nHeat bacon fat remaining in skillet over moderately high heat until hot but not smoking and cook caraway seeds, stirring, until fragrant, about 30 seconds. Add red cabbage, carrots, vinegar mixture, and salt and pepper to taste and sauté, stirring, until cabbage is just wilted, about 1 minute.\nRemove skillet from heat and add Napa cabbage and scallions, tossing until cabbage is wilted slightly.\nDivide slaw among 6 plates. Cut each quail into 4 serving pieces and arrange decoratively over slaw. Top salads with bacon.\nDivide slaw among 6 plates. Cut each quail into 4 serving pieces and arrange decoratively over slaw. Top salads with bacon.",
    "title": "Grilled Quail with Wilted Cabbage Slaw"
  },
  {
    "ingredients": [
      "2 tablespoons olive oil, divided",
      "12 ounces beef tenderloin, cut into 1-inch cubes",
      "1 cup sliced shallots (about 3 large)",
      "8 ounces peeled baby carrots",
      "2 teaspoons ground cumin",
      "1 1/2 teaspoons pumpkin pie spice",
      "1/8 teaspoon cayenne pepper",
      "1 tablespoon all purpose flour",
      "2 1/2 cups beef broth",
      "1/3 cup chopped fresh mint, divided"
    ],
    "picture_link": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=750&h=375&url=https%3A%2F%2Fassets.marthastewart.com%2Fstyles%2Fwmax-750%2Fd57%2Fspiced-beef-stew-with-carrots-and-chickpeas-0e6d59f7-0220%2Fspiced-beef-stew-with-carrots-and-chickpeas-0e6d59f7-0220_horiz.jpg%3Fitok%3D_tU0WCq3",
    "instructions": "Heat 1 tablespoon oil in large nonstick skillet over high heat. Sprinkle beef with salt and pepper. Add beef to skillet and sauté until cooked to desired doneness, about 2 minutes for medium-rare. Using slotted spoon, transfer beef to bowl. Add remaining 1 tablespoon oil to skillet. Add shallots and carrots and sauté until golden, about 3 minutes. Add all spices; stir 30 seconds. Sprinkle flour over; stir 30 seconds. Stir in broth and bring to boil. Reduce heat to medium; simmer until carrots are just tender, about 8 minutes. Return beef to skillet; cook until sauce thickens slightly, about 1 minute. Season stew to taste with salt and pepper. Stir in 1/4 cup chopped mint. Transfer stew to bowls. Sprinkle with remaining chopped mint and serve.\nHeat 1 tablespoon oil in large nonstick skillet over high heat. Sprinkle beef with salt and pepper. Add beef to skillet and sauté until cooked to desired doneness, about 2 minutes for medium-rare. Using slotted spoon, transfer beef to bowl. Add remaining 1 tablespoon oil to skillet. Add shallots and carrots and sauté until golden, about 3 minutes. Add all spices; stir 30 seconds. Sprinkle flour over; stir 30 seconds. Stir in broth and bring to boil. Reduce heat to medium; simmer until carrots are just tender, about 8 minutes. Return beef to skillet; cook until sauce thickens slightly, about 1 minute. Season stew to taste with salt and pepper. Stir in 1/4 cup chopped mint. Transfer stew to bowls. Sprinkle with remaining chopped mint and serve.",
    "title": "Spiced Beef Stew with Carrots and Mint"
  },
  {
    "ingredients": [
      "8 cups water",
      "2 chicken breast halves; skin and fat removed",
      "2 whole chicken legs with thighs; skin and fat removed",
      "3 carrots, peeled, halved crosswise",
      "3 celery stalks, quartered crosswise",
      "1 onion, sliced",
      "2 teaspoons salt",
      "2 garlic cloves, chopped",
      "1 bay leaf",
      "3/4 cup uncooked long-grain white rice",
      "Chopped fresh parsley"
    ],
    "picture_link": "https://thestayathomechef.com/wp-content/uploads/2020/12/Moms-Chicken-and-Rice-Soup-6.jpg",
    "instructions": "Combine first 9 ingredients in large pot. Bring to boil. Reduce heat, cover and simmer until chicken is cooked through, about 35 minutes. Using slotted spoon, transfer chicken and carrots to platter; cool slightly. Pull chicken meat off bones in bite-size pieces; set aside. Discard bones. Thinly slice carrots and reserve. Strain broth; discard solids in strainer. Pour 1 1/2 cups broth into heavy medium saucepan. Bring to boil. Add rice and bring to boil. Reduce heat to low; cover and cook until broth is absorbed and rice is tender, about 20 minutes. Return remaining broth, chicken pieces and sliced carrots to same large pot. Bring to simmer. Stir in cooked rice. Season soup with salt and pepper. Ladle soup into bowls. Sprinkle with parsley and serve.\nCombine first 9 ingredients in large pot. Bring to boil. Reduce heat, cover and simmer until chicken is cooked through, about 35 minutes. Using slotted spoon, transfer chicken and carrots to platter; cool slightly. Pull chicken meat off bones in bite-size pieces; set aside. Discard bones. Thinly slice carrots and reserve. Strain broth; discard solids in strainer. Pour 1 1/2 cups broth into heavy medium saucepan. Bring to boil. Add rice and bring to boil. Reduce heat to low; cover and cook until broth is absorbed and rice is tender, about 20 minutes.\nReturn remaining broth, chicken pieces and sliced carrots to same large pot. Bring to simmer. Stir in cooked rice. Season soup with salt and pepper. Ladle soup into bowls. Sprinkle with parsley and serve.",
    "title": "Mom's Hearty Chicken and Rice Soup"
  }
]
